# Ի՞նչ տարբերություն iterable և iterator տերմինների միջև։ Բերել օրինակներ, 
# որտեղ համապատասխանաբար ներկայացված կլինեն այդ երկուսը։
    # Iterable են այն օբյեկտները, որոնց վրա կարող ենք իտերացիա կատարել։
    # Iterator-են այն օբյեկտները, որոնց օգնությամբ կարող ենք իտերացիա կատարել iterable օբյեկտների վրա։ 
    # Դրա համար օգնության են գալիս, iter() և next() ֆունկցիաները։

ls = [1,2,3,4,5,6,7,8]
it = iter(ls) # iter-ը ստանում է միայն iterable
print(next(it)) # next-ը կանչելիս ամեն անգամ հղվում ենք լիստի մեկ էլեմենտի վրա, վերադարձնում ենք այդ էլեմենտը
print(next(it)) # և հղումը փոխում հաջորդ էլեմանտի վրա, մինչև կհասնենք StopIteration-ին, որի ժամանակ իտերացիան ավարտվում է.
print(next(it))
print(next(it))
print(next(it))
print(next(it))
print(next(it))
print(next(it))
print(next(it))

